---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AssemblyFailures.MixedPhasesInAssembly
source: html/238ddab3-fc3c-fd4b-2fb7-e5dfeebc2653.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AssemblyFailures.MixedPhasesInAssembly Property

Assembly cannot be created. All elements must have the same phases to be included in an assembly.

## Syntax (C#)
```csharp
public static FailureDefinitionId MixedPhasesInAssembly { get; }
```